"use strict";

let questions = [
    {
        words: ["מה","זה","קידוד"],
        score: [20, 20, 20],
        replay: `קידוד זה תהליך שבו המחשב צורב את הכתוביות של התרגום על גבי הוידאו. תהליך זה נמשך כ- 30 דקות.`
    },
    {
        words: ["מה","זה","העלאה"],
        score: [20, 20, 20],
        replay: `השלב האחרון שהוא אחרי השלב של הקידוד. הפרק נמצא על המחשב, אנחנו מעלים אותו לשרתי צפייה והורדה כדי שתוכלו לצפות בפרק או להוריד אותו.`
    },
    {
        words: ["מה","זה","עריכה","לשונית"],
        score: [20, 20, 20, 10],
        replay: `לאחר שלב התרגום, התפקיד של העורך זה לעבור על התרגום ולתקן ניסוחים לקויים ושגיאות כתיב או שגיאות הקלדה.`
    },
    {
        words: ["מה","זה","תזמון"],
        score: [20, 20, 20],
        replay: `התזמון הוא התהליך שבו מתזמנים את הכתוביות בעברית שיופיעו בזמן שהדמויות מדברות. למרות שכבר יש תזמון מוכן מהכתוביות באנגלית, התזמון לא מדויק כל כך לכן אנחנו מתזמנים מחדש.`
    },
    {
        words: ["מה","זה","בקרת","איכות"],
        score: [20, 20, 20, 20],
        replay: `בקרת איכות זה התהליך שבו המבקר עובר על התוצר הסופי ובודק שהכל בסדר מבחינת תרגום, תזמון, טייפ וכו'.`
    },
    {
        words: ["מה","זה","טייפ"],
        score: [20, 20, 20, 20],
        replay: `טייפ זה בעצם עיצוב דפוס. כאשר בפרק כתוב ביפנית על גבי מכתבים/מסכים/שלטים וכו', אנחנו מתרגמים את הכתוב לעברית בצמוד ליפנית, בצורה כזו שזה יראה טבעי כאילו זה חלק מהאנימציה.`
    },
    {
        words: ["אתה","מטומטם","מפגר","טיפש","טמבל"],
        score: [20, 30, 30, 30, 30],
        replay: `מצטער שלא הצלחתי לעזור לך.`
    },
    {
        words: ["מי","תכנת","אותך"],
        score: [10, 30, 10],
        replay: `איתי המלך.`
    },
    {
        words: ["איפה","אפשר","לצפות","לראות","את","הפרקים","איך","רואים","להוריד","מורידים","צופים","בפרקים", "פרקים"],
        score: [15, 10, 15, 15, 10, 20, 10, 15, 15, 15, 15, 20, 20],
        replay: `אפשר לצפות בפרקים דרך עמוד הצפייה הישירה באתר - מומלץ להתקין חוסם פרסומות. או לחלופין להוריד את הפרקים מעמוד הטלגרם שלנו או בטורנט דרך עמוד ההורדות.`
    },
    {
        words: ["איפה","אפשר","לצפות","לראות","את","הסרטים","איך","רואים","להוריד","מורידים","צופים","בסרטים", "סרטים","את","הסרט"],
        score: [15, 10, 15, 15, 10, 20, 10, 15, 15, 15, 15, 20, 20, 10, 20],
        replay: `אפשר לראות חלק מהסרטים בצפייה ישירה דרך התפריט הצדדי שבאתר - פשוט לא כל הסרטים שם עובדים. תוכלו להוריד את כל הסרטים מעמוד הטלגרם שלנו או בטורנט דרך עמוד ההורדות שבאתר.`
    },
    {
        words: ["כמה","פרקים","יש","נארוטו", "שיפודן"],
        score: [20, 15, 10, 10, 10],
        replay: `יש בנארוטו 220 פרקים. בנארוטו שיפודן יש 500 פרקים.`
    },
    {
        words: ["כמה","חברי","צוות","אתם","יש","לכם"],
        score: [20, 15, 15, 10, 10, 10],
        replay: `אנחנו בסה"כ שני חברי צוות.`
    },
    {
        words: ["לשאול","איזה","שאלות","אפשר","אותך","מה","לעזור","אתה","יכול","איך","עונה","יודע", "לענות","על","לי"],
        score: [20, 10, 20, 10, 10, 10, 10, 20, 10, 10, 10, 10, 10, 10, 10],
        replay: `אני יכול לענות לשאלות על האתר, ואפילו למצוא לכם באיזה פרק התרחש קרב בסדרה ומתי דמות מתה.`
    },
    {
        words: ["למה","לוקח","לכם","המון","הרבה","זמן","להוציא","פרק","פרקים","חדש","חדשים"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10],
        replay: `אנחנו רק 2 חברי צוות, ויש לנו גם עיסוקים בחיינו האישיים, לכן לוקח לנו זמן לתרגם ולשחרר את הפרקים. אנחנו גם לא מתפשרים על איכות.`
    },
    {
        words: ["פרסומות","חוסם","מתקינים","איך","להתקין"],
        score: [20, 20, 10, 10, 10],
        replay: `היכנסו לעמוד שאלות ותשובות, יש שם קישור שמוביל להסבר על ההתקנה. בגדול זה תוסף שמתקינים בדפדפן שלכם.`
    },
    {
        words: ["17.12", "17/12","ב-17.12","ב-17/12","ב17.12", "ב17/12","ה-17.12","ה-17/12", "הכרזה", "ההכרזה","על", "מה", "נארוטו","של", "איזה", "יש","תאריך","בתאריך"],
        score: [30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 10, 10, 10, 10, 10, 10, 10, 10],
        replay: `יצאה הכרזה שבתאריך ה-17.12 יצא משהו שקשור לאנימה של נארוטו. אנחנו לא יודעים על מה מדובר, השאירו אותנו בסימן שאלה, נצטרך פשוט לחכות ולראות.`
    },
    {
        words: ["יש","איפה", "הפרקים", "פרקים", "של", "נארוטו", "170", "171", "220", "119", "עד", "למה", "אין", "את", "חסרים", "מופיעים", "לא", "מ171", "מ-171", "מ-170", "מ170", "170-220", "171-219","באתר"],
        score: [10, 20, 10, 10, 10, 10, 40, 40, 40, 40, 20, 10, 20, 10, 30, 30, 10, 40, 40, 40, 40, 40, 40, 10],
        replay: `לא סיימנו לתרגם את נארוטו פארט 1, עצרנו בפרק 170.
        פרקים אלה הם פילרים וניתן לדלג עליהם ולהמשיך לצפות בפרק 220 מדקה 11:40 ואז לעבור לשיפודן.`
    },
    {
        words: ["איכות", "צפייה", "נוראית", "הצפייה", "באיכות", "לא", "טובה", "למה", "גרועה", "האיכות"],
        score: [40, 30, 20, 30, 40, 10, 10, 10, 20, 40],
        replay: `כאשר אנחנו מעלים פרק חדש, לגוגל לוקח זמן לאפשר צפייה בפרק באיכות גבוהה ומקסימלית של 1080P. עליכם להוריד את הפרק או להמתין.
        אם מדובר בפרקים ישנים של נארוטו, אז האיכות ששודרה פעם הייתה נמוכה ולכן זה ככה.`
    },
    {
        words: ["פרסומות", "הנטאי", "סוטות", "למה", "יש", "לא", "צנועות", "הפרסומות", "איך", "מסירים", "מעיפים", "מודעות", "פרסומת", "מודעה", "פירסומות", "וירוסים", "וירוס", "סקס", "בצפייה", "הישירה", "פורנו"],
        score: [40, 20, 20, 5, 5, 5, 5, 40, 5, 5, 5, 40, 40, 40, 40, 20, 20, 20, 5, 5, 20],
        replay: `אנחנו משתמשים בשרת צפייה חינמי עבור הצפייה הישירה, והשרת הזה מגיע עם פרסומות. התקינו חוסם פרסומות כדי שהן לא יופיעו במהלך הצפייה.`
    },
    {
        words: ["אין", "קול", "בפרק", "סאונד", "שומעים", "לא", "שמע", "אודיו", "למה", "בפרקים", "לשמוע"],
        score: [20, 40, 10, 40, 40, 10, 40, 40, 10, 10, 20],
        replay: `כנראה שהפרק שהורדתם מופעל עם נגן שלא יודע לנגן את הקול של הפרק.
        התקינו נגן VLC או נגן MPC במחשב שלכם והפעילו את הפרק משם.`
    },
    {
        words: ["מה", "זה", "מנגה"],
        score: [10, 10, 50],
        replay: `מנגה זהו קומיקס יפני בשחור לבן שסדרת האנימה מבוססת עליו.
        עלילת המנגה מקדימה את עלילת האנימה.`
    },
    {
        words: ["להצטרף", "איך", "לצוות", "אפשר", "אני", "יכול", "מצטרפים"],
        score: [40, 10, 20, 10, 10, 10, 40],
        replay: `תוכלו לבקש להצטרף לצוות על ידי פניה דרך הטלגרם/פייסבוק.`
    },
    {
        words: ["באיזה", "סדר", "לצפות", "לראות", "את", "איזה", "מה", "הסדר", "הצפייה", "של", "נארוטו"],
        score: [10, 40, 20, 20, 10, 10, 10, 40, 20, 10, 20],
        replay: `קודם לצפות בנארוטו, אחר כך נארוטו שיפודן, ואחר כך בורוטו.
        יש עמוד באתר שמסביר מתי לצפות בסרטים.`
    },
    {
        words: ["אתם", "מרוויחים", "כסף", "על", "עבודתכם", "התרגום", "מקבלים", "מהתרגום"],
        score: [20, 30, 30, 10, 10, 10, 10, 10],
        replay: `לא. אנחנו לא מרוויחים על עבודתנו כלום.`
    },
    {
        words: ["אתם", "מקבלים", "תרומות", "לתת", "לכם", "אפשר", "לתרום", "אני", "יכול"],
        score: [20, 10, 40, 10, 10, 10, 40, 10, 10],
        replay: `כן. יש לכם אפשרות לתרום דרך העמוד הראשי של האתר.`
    },
    {
        words: ["למה", "רשום", "שהפרק", "בעיבוד", "הפרק", "כתוב"],
        score: [10, 10, 20, 60, 20, 10],
        replay: `ברגע שאנחנו מעלים פרק חדש לגוגל דרייב, לגוגל לוקח זמן לאפשר צפייה ישירה לפרק. לכן רשום שהפרק בעיבוד. תצטרכו להמתין או להוריד.`
    },
    {
        words: ["מה", "זה", "פילר", "פילרים", "למה"],
        score: [10, 10, 50, 50, 10],
        replay: `פילרים אלו פרקים שלא קשורים לעלילת המנגה. הפילרים נועדו לשמור על הפער שבין עלילת המנגה והאנימה.`
    },
    {
        words: ["כדאי", "מומלץ", "לצפות", "יש", "טעם", "לראות", "1", "פארט", "נארוטו", "שווה", "האם"],
        score: [20, 20, 20, 10, 10, 20, 10, 10, 20, 20, 10],
        replay: `בטח! אני סדרה מעולה דאטביו!`
    },
    {
        words: ["כדאי", "מומלץ", "לצפות", "יש", "טעם", "לראות", "שווה", "האם", "בורוטו"],
        score: [20, 20, 20, 10, 10, 20, 20, 10, 30],
        replay: `בורוטו לא יצא מוצלח כמוני, צפו אם משעמם לכם, או אם בא לכם לראות אותי עוד על המסך!`
    },
    {
        words: ["מה", "זה", "טורנט","איך","מורידים","בטורנט"],
        score: [20, 20, 20, 15, 15, 20],
        replay: `טורנט זו תוכנה המאפשרת להוריד ולשתף קבצים. צריך להוריד ולהתקין אותה בשביל להשתמש בה.`
    },
    {
        words: ["מתי", "יוצא", "פרק", "חדש", "יתורגם", "יתרגמו", "את", "הפרק", "הפרקים", "הבאים", "חדשים", "יצאו", "עולים", "יוצאים", "ימים", "פרקים", "עולה", "יעלו", "כל", "זמן", "שעה", "הבא", "של", "בורוטו"],
        score: [20, 10, 30, 10, 10, 10, 5, 30, 30, 5, 5, 10, 10, 10, 5, 30, 10, 10, 10, 10, 10, 10, 10, 10],
        replay: `הפרקים של בורוטו יוצאים כל יום ראשון בשעה 12:00 (שעון קיץ) או 11:00 (שעון חורף) מתורגמים לאנגלית. מאנגלית אנחנו מתרגמים לעברית. העבודה שלנו על הפרק תלויה בזמינות חברי הצוות ולכן יכולה לקחת שעות או ימים. לכן, אין יום קבוע לפרסום הפרק מתורגם לעברית. תוכלו לעקוב אחרי ההתקדמות שלנו על ידי מד הפרקים המוצמד לאתר שמתעדכן בזמן אמת ברגע שהסתיים שלב.`
    },
    {
        words: ["מה", "זה", "קאנון"],
        score: [10, 10, 50],
        replay: `מנגה קאנון זהו פרק שהוא לא פילר, ומבוסס על העלילה שבמנגה.`
    },
    {
        words: ["יש", "צפייה", "בנארוטו", "דרך", "גוגל", "דרייב", "אפשר", "לצפות", "עם", "אפשרות", "בדרייב", "בגוגל", "נארוטו", "לראות", "למה", "אין", "את", "הפרקים", "פרקים"],
        score: [5, 20, 20, 10, 20, 10, 10, 20, 10, 10, 20, 10, 20, 10, 10, 10, 10, 10, 10],
        replay: `ניתן לצפות רק בבורוטו דרך גוגל דרייב. כאשר העלנו את הפרקים של נארוטו לגוגל דרייב הם נחסמו.`
    },
    {
        words: ["פרק", "לא", "עובד", "הפרק", "הסרט", "סרט", "למה", "הפרקים", "עובדים", "אי", "אפשר", "לראות", "פועל", "פועלים"],
        score: [30, 10, 10, 30, 30, 30, 30, 5, 30, 10, 5, 5, 10, 10, 10],
        replay: `אם פרק או סרט בצפייה ישירה לא עובד, נסו להפעיל אותו מאוחר יותר.
        אם זה לא עובד גם אחרי יום-יומיים, תוכלו להוריד אותו מהטלגרם ולדווח לנו כדי שנטפל בזה.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרטים", "צריך", "כדאי", "מומלץ","את", "הסרטים"],
        score: [10, 10, 10, 30, 10, 10, 10, 10, 20],
        replay: `יש עמוד באתר שמסביר מתי לצפות בסרטים.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "הראשון", "של", "נארוטו", "נסיכת", "השלג", "את", "הסרט"],
        score: [10, 10, 10, 20, 10, 5, 20, 25, 25, 10, 10],
        replay: `מומלץ לצפות בסרט הראשון של נארוטו - נסיכת השלג, רק לאחר שהגעתם לפרק 96 בנארוטו פארט 1.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "השני", "של", "נארוטו", "אשליית", "הרס", "את", "הסרט", "העולם"],
        score: [10, 10, 10, 20, 10, 5, 20, 25, 25, 10, 10, 25],
        replay: `מומלץ לצפות בסרט השני של נארוטו - אשליית הרס העולם, רק לאחר שהגעתם לפרק 135 בנארוטו פארט 1.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "השלישי", "של", "נארוטו", "שיפודן", "קשרים", "את", "הסרט"],
        score: [10, 10, 10, 20, 10, 5, 10, 10, 50, 10, 10],
        replay: `מומלץ לצפות בסרט השלישי של נארוטו שיפודן- קשרים, רק לאחר שהגעתם לפרק 53 ולפני שהגעתם לפרק 113 בנארוטו שיפודן.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "הרביעי", "של", "נארוטו", "שיפודן", "המגדל", "האבוד", "את", "הסרט"],
        score: [10, 10, 10, 20, 10, 5, 20, 20, 25, 25, 10, 10],
        replay: `מומלץ לצפות בסרט הרביעי של נארוטו שיפודן- המגדל האבוד, רק לאחר שהגעתם לפרק 118 ולפני שהגעתם לפרק 167 בנארוטו שיפודן.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "החמישי", "של", "נארוטו", "שיפודן", "כלא", "הדם", "את", "הסרט"],
        score: [10, 10, 10, 20, 10, 5, 20, 20, 25, 25, 10, 10],
        replay: `מומלץ לראות את הסרט החמישי של נארוטו שיפודן - כלא הדם, רק לאחר שהגעתם לפרק 200 ולפני שהגעתם לפרק 223 בנארוטו שיפודן.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "השישי", "של", "נארוטו", "שיפודן", "דרך", "הדרך", "אל", "הנינג'ה", "הסרט"],
        score: [10, 10, 10, 20, 10, 5, 20, 20, 25, 25, 20, 25, 10, 10],
        replay: `מומלץ לראות את הסרט השישי של נארוטו שיפודן - הדרך אל הנינג'ה, ממש לאחר שהגעתם לפרק 256 בנארוטו שיפודן.
        שימו לב שכדאי לצפות בפרק 311 לפני הסרט ובפרק 271 אחרי הסרט כי אלו פרקים הקשורים לסרט.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "השביעי", "של", "נארוטו", "שיפודן", "האחרון", "הדם", "את", "הסרט"],
        score: [10, 10, 10, 20, 10, 5, 10, 10, 20, 25, 10, 10],
        replay: `מומלץ לראות את הסרט השביעי של נארוטו שיפודן - האחרון, רק לאחר שהגעתם לפרק 493 בנארוטו שיפודן.`
    },
    {
        words: ["מתי", "לצפות", "לראות", "בסרט", "בורוטו", "של", "את", "הסרט"],
        score: [10, 10, 10, 15, 15, 10, 10, 15],
        replay: `מומלץ לראות את הסרט של בורוטו, אחרי שסיימתם לצפות בנארוטו שיפודן. העלילה של הסרט מורחבת באנימה של בורוטו, אז לא חובה לצפות בסרט.`
    },
    {
        words: ["כדאי", "לדלג", "על", "הפילרים", "מומלץ", "האם", "אפשר", "של", "נארוטו", "בנארוטו", "שיפודן", "בפילרים", "לצפות", "לראות", "פילרים", "את"],
        score: [10, 20, 10, 30, 10, 10, 10, 10, 30, 30, 10, 30, 10, 10, 30, 10],
        replay: `הפילרים בנארוטו ובנארוטו שיפודן לא קשורים לעלילה, אך מוסיפים מידע על דמויות משנה. לא חובה לצפות בהם אבל מומלץ שכן.`
    },
    {
        words: ["כדאי", "לדלג", "על", "הפילרים", "מומלץ", "האם", "אפשר", "של", "בורוטו", "בפילרים", "לצפות", "לראות", "פילרים", "את"],
        score: [10, 20, 10, 30, 10, 10, 10, 10, 30, 30, 10, 10, 30, 10],
        replay: `רוב האנימה של בורוטו היא פילרית. אם אתם חושבים לדלג על הפילרים, כבר מומלץ פשוט לקרוא את המנגה של בורוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "קאקאשי", "נלחם", "זאבוזה", "נגד", "הקרב", "בין", "פרקים", "נלחמו","מתי"],
        score: [10, 10, 10, 20, 10, 20, 10, 10, 10, 5, 10, 10],
        replay: `הקרב בין קאקאשי לזאבוזה הופיע בפרקים 7-9 בנארוטו ו-266 בשיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "האקו", "מת", "המוות", "של", "מתי"],
        score: [10, 10, 10, 30, 20, 10, 10, 10],
        replay: `האקו מת בפרק 18 של נארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "זאבוזה", "מת", "המוות", "של", "מתי"],
        score: [10, 10, 10, 30, 20, 20, 10, 10],
        replay: `זאבוזה מת בפרק 19 של נארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "לי", "נלחם", "סאסקה", "נגד", "הקרב", "בין", "נלחמו", "של", "מתי"],
        score: [10, 10, 10, 15, 10, 15, 10, 10, 10, 10, 10, 10],
        replay: `הקרב בין לי וסאסקה הופיע בפרק 22 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "אורוצ'ימארו", "נלחם", "סאסקה", "נגד", "הקרב", "בין", "נלחמו", "של", "מתי"],
        score: [10, 10, 10, 15, 10, 15, 10, 10, 10, 10, 10, 10],
        replay: `הקרבות בין סאסקה ואורוצ'ימארו הופיעו בפרקים 28-30 בנארוטו , 113-114 בשיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "סאקורה", "גזרה", "את", "השיער", "מתי"],
        score: [10, 10, 10, 30, 20, 10, 10, 10],
        replay: `סאקורה גזרה את שיערה עם קונאי בפרק 32 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "סאקורה", "נלחמה", "אינו", "נגד", "הקרב", "בין", "נלחמו", "של", "מתי"],
        score: [10, 10, 10, 15, 10, 15, 10, 10, 10, 10, 10, 10],
        replay: `הקרב בין סאקורה ואינו הופיע בפרקים 41-42 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נארוטו", "נלחם", "קיבה", "נגד", "הקרב", "בין", "נלחמו", "של", "מתי"],
        score: [10, 10, 10, 15, 10, 15, 10, 10, 10, 10, 10, 10],
        replay: `הקרב בין נארוטו וקיבה הופיע בפרקים 44-45 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "הינאטה", "נלחם", "נג'י", "נגד", "הקרב", "בין", "נלחמו", "של", "מתי", "נלחמה"],
        score: [10, 10, 10, 15, 10, 15, 10, 10, 10, 10, 10, 10, 10],
        replay: `הקרב בין הינאטה ונג'י הופיע בפרקים 46-47 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "לי", "גאארה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 15],
        replay: `הקרב בין לי וגאארה הופיע בפרקים 48-50 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נארוטו", "נג'י"],
        score: [10, 10, 10, 15, 10, 10, 10, 10, 10, 15, 15, 15, 15],
        replay: `הקרב בין נארוטו ונג'י הופיע בפרקים 60-62 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נלחמה", "שיקאמארו", "טמארי"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 15],
        replay: `הקרב בין שיקאמארו וטמארי הופיע בפרק 64 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "סאסקה", "גאארה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין סאסקה וגאארה הופיע בפרקים 66, 74-75 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "הירוזן", "אורוצ'ימארו", "וההוקאגה", "השלישי"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 15, 10, 10],
        replay: `הקרב בין ההוקאגה השלישי ואורוצ'ימארו הופיע בפרקים 69-79 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נלחמה", "סאסקה", "טמארי"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20, 20],
        replay: `הקרב בין סאסקה וטמארי הופיע בפרק 72 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "שינו", "קאנקורו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין שינו וקאנקורו הופיע בפרק 74 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נארוטו", "גאארה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו וגאארה הופיע בפרקים 75-80 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "קאקאשי", "איטאצ'י"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין קאקאשי ואיטאצ'י הופיע בפרקים 81-82 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נארוטו", "קאבוטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו וקאבוטו הופיע בפרקים 93-95 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נארוטו", "סאסקה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרבות בין נארוטו וסאסקה הופיעו בפרקים 107-108, 128-134 בנארוטו ופרקים 51-53 , 215-216, 475-478 בשיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "איטאצ'י", "סאסקה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרבות בין סאסקה ואיטאצ'י הופיעו בפרקים 83-85 בנארוטו ו-135-138 בשיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "אורוצ'ימארו", "נארוטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו ואורוצ'ימארו הופיע בפרקים 39-43 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נלחמה", "יוגיטו", "הידאן", "קאקוזו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 15, 30, 10, 10],
        replay: `הקרב בין יוגיטו להידאן וקאקוזו הופיע בפרק 72 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "אסומה", "הידאן"],
        score: [10, 10, 10, 20, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין אסומה והידאן הופיע בפרקים 77-80 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "אסומה", "הידאן"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין אסומה והידאן הופיע בפרקים 77-80 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "שיקאמארו", "הידאן"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרבות בין שיקאמארו והידאן הופיעו בפרקים 77-80, 85-87 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נארוטו", "קאקוזו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו לקאקוזו הופיע בפרקים 86-89 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "סאסקה", "דידארה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין סאסקה לדידארה הופיע בפרקים 122-125 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "ג'יראיה", "פיין"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין ג'יראיה לפיין הופיע בפרקים 130-133 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "מאדארה", "האשיראמה", "ההוקאגה", "הראשון"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20, 10, 10],
        replay: `הקרב בין האשיראמה למאדארה הופיע בפרק 140 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "סאסקה", "בי", "קילר"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20, 10],
        replay: `הקרב בין קילר בי לסאסקה הופיע בפרקים 130-133 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "קונוהאמארו", "פיין"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין קונוהאמארו לפיין הופיע בפרק 162, 423 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "נארוטו", "פיין"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו לפיין הופיע בפרקים 163-165 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "הינאטה", "פיין","נלחמה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20, 10],
        replay: `הקרב בין הינאטה לפיין הופיע בפרקים 166 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "ראיקאגה", "סאסקה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין סאסקה לראיקאגה הופיע בפרקים 202-203 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "קיסאמה", "בי","קילר"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20, 10],
        replay: `הקרב בין קילר בי לקיסאמה הופיע בפרקים 206-207 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "דנזו", "סאסקה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין סאסקה לדנזו הופיע בפרקים 209-211 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "קוראמה", "נארוטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו לקוראמה הופיע בפרקים 245-246 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "טובי", "מינאטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין מינאטו לטובי הופיע בפרקים 248-249 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "טובי", "קונאן"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין קונאן לטובי הופיע בפרקים 252-253 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "ראיקאגה", "נארוטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין נארוטו ובי לראיקאגה הופיע בפרקים 282-283 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "אוביטו", "מינאטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין מינאטו לאוביטו הופיע בפרקים 375, 378-387 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "מאדארה", "מינאטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין מינאטו למאדארה הופיע בפרק 415 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "מאדארה", "גאי"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין גאי למאדארה הופיע בפרקים 418-421 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "אשורה", "אינדרה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרב בין אינדרה לאשורה הופיע בפרק 468 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "ראיקאגה", "נארוטו", "השלישי"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 15, 20, 20, 15],
        replay: `הקרב בין נארוטו לראיקאגה השלישי הופיע בפרק 301 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "קאקאשי", "אוביטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 15, 20, 20],
        replay: `הקרבות בין קאקאשי לאוביטו הופיעו בפרקים 371-372, 375 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "בי", "נארוטו","איטאצ'י", "נאגאטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 20, 10, 10, 10, 10],
        replay: `הקרב בין נארוטו ובי לנאגאטו ואיטאצ'י הופיע בפרקים 298-299 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "קאקאשי", "נארוטו","איטאצ'י", "סאקורה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10],
        replay: `הקרב בין נארוטו, קאקאשי וסאקורה לאיטאצ'י הופיע בפרקים 13-15 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "בי", "נארוטו","טובי"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 10, 15, 15],
        replay: `הקרב בין נארוטו ובי לטובי הופיע בפרקים 323-324 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "איטאצ'י", "סאסקה","קאבוטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 10, 15, 15],
        replay: `הקרב בין סאסקה ואיטאצ'י לקאבוטו הופיע בפרקים 334-340 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "מאדארה", "נארוטו"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 20, 20],
        replay: `הקרבות בין נארוטו למאדארה הופיעו בפרקים 322-323, 344, 362 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "נלחם", "של", "מתי", "נגד", "הקרב", "בין", "נלחמו", "מאדארה", "חמשת", "הקאגה", "טסונאדה", "גאארה", "ראיקאגה","טסוצ'יקאגה", "מיזוקאגה"],
        score: [10, 10, 10, 10, 10, 10, 10, 10, 10, 15, 20, 15, 15, 10, 10, 10, 10, 10],
        replay: `הקרב בין חמשת הקאגה למאדארה הופיע בפרקים 323-324, 332-334, 339-340, 343-344 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "הירוזן", "ההוקאגה", "השלישי"],
        score: [10, 10, 10, 10, 30, 20, 10, 10],
        replay: `ההוקאגה השלישי מת בפרק 79 בנארוטו.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "אסומה"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `אסומה מת בפרק 80 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "הידאן"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `הידאן מת בפרק 87 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "קאקוזו"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `קאקוזו מת בפרק 89 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "נאגאטו"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `נאגאטו מת בפרק 175 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מתה", "קונאן"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `קונאן מתה בפרק 253 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "נג'י"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `נג'י מת בפרק 364 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "מינאטו"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `מינאטו מת בפרק 249 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "אוביטו"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `אוביטו מת בפרק 120 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מתה", "קושינה"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `קושינה מתה בפרק 249, 350 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "שיסוי"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `שיסוי מת בפרק 455 בנארוטו שיפודן.`
    },
    {
        words: ["איזה", "באיזה", "פרק", "מתי", "מת", "ג'יראיה"],
        score: [10, 10, 10, 10, 30, 20],
        replay: `ג'יראיה מת בפרק 133 בנארוטו שיפודן.`
    },
    {
        words: ["היי"],
        score: [55],
        replay: `היי, איך אני יכול לעזור?`
    },
    {
        words: ["שלום"],
        score: [55],
        replay: `שלום, איך אני יכול לעזור?`
    },
];



let namesList = [
    ["נארוטו","נרוטו", "נרותו", "נארותו"],
    ["שיקאמארו","שיקמרו", "שיקאמרו", "שיקמארו"],
    ["סאסקה","ססקה","סאסוקה",""],
    ["סאקורה","סקורה"],
    ["קאקאשי","קאקשי","קקשי"],
    ["מאדארה","מדרה","מאדרה"],
    ["נאגאטו","נגטו","נגתו","נאגטו"],
    ["אוביטו","אוביתו"],
    ["הינאטה","הינטה","הינתה","הינאתה"],
    ["בורוטו","בורטו", "בוריתו", "בורותו","בוריטו","בורתו"],
    ["גאארה","גארה"],
    ["ג'יראיה","גיראיה"],
    ["טסונאדה","טסונדה"],
    ["אורוצ'ימארו","אורוצימרו","אורוצ'ימרו","אורוצימארו"],
    ["הידאן","הידן"],
    ["נג'י","נגי"],
    ["לי"],
    ["דנזו"],
    ["אינו"],
    ["טמארי","טמרי"],
    ["קאקוזו","קקוזו"],
    ["איטאצ'י","איטצ'י","איטאצי","איטצי"],
    ["אסומה"],
    ["סאי"],
    ["קאבוטו", "קבוטו"],
    ["יאמאטו", "יאמטו"],
    ["גאי", "גיא"],
    ["בי"],
    ["קילר"],
    ["קיסאמה", "קיסמה"],
    ["קושינה"],
    ["מינאטו", "מינטו", "מינתו", "מינטו"],
    ["קונוהאמארו", "קונוהמרו", "קונוהאמרו"],
    ["קונאן", "קונן"],
    ["זאבוזה", "זבוזה"],
    ["קאנקורו", "קנקורו"],
    ["הירוזן"],
    ["סויגטסו"],
    ["מאדארה", "מדרה"],
    ["טובי"],
    ["שיסוי"],
    ["שיקאמארו","שיקמרו","שיקאמרו"],
    ["אינו"],
    ["יוגיטו"],
    ["פיין"],
    ["האשיראמה","השיראמה","השירמה"],
    ["האקו"],
    ["קיבה"],
    ["הוקאגה"],
    ["קוראמה","קורמה"],
    ["ראיקאגה"]
];

function send() {
    // event.preventDefault();
    let questionInput = document.getElementById("question");
    let question = questionInput.value;
    question = question.replaceAll(/\?|\!|\.|\,/g, "").split(" ");
    question = [...new Set(question)];
    question = fixNamesIssues(question);
    search(question);

}

function fixNamesIssues(question) {

    question.forEach((word, index) => {

        namesList.forEach(obj => {
            obj.forEach(issue=>{
                let issue1 = "ל" + issue;
                let issue2 = "ו" + issue;
                let issue3 = "ב" + issue;
    
                if (word == issue || word == issue1 || word == issue2 || word == issue3) {
                    question[index] = obj[0];
                }
            })
        })
    })

    console.log(question);
    return question;

}


function search(question) {
    let replay = "";
    let maxScore = 0;
    let score = 0;
    let wordsNotMatch = 0;


    questions.forEach(obj => {
        question.forEach(word => {
            let index = obj.words.findIndex(ObjWord => ObjWord == word);
            if (index >= 0) {
                score = score + obj.score[index];
            }
            else {
                wordsNotMatch++;
            }
        });

        score = score - (wordsNotMatch * 5);

        if (score > maxScore) {
            maxScore = score;
            replay = obj.replay;
        }
        score = 0;
        wordsNotMatch = 0;
    });

    console.log("maxscore: " + maxScore);


    let answer = document.getElementById("answer");

    if (maxScore >= 50) {
        answer.innerHTML = replay;
    }

    else {
        answer.innerHTML = `אין לי תשובה לשאלתך`;
    }
}